from binascii import b2a_base64
import random


cube1 = '''
+-----+
|     |
|  0  |
|     |
+-----+

'''
# print(cube1)
# face - лицо (грань)
face_1 = { "view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '1' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 1
}

face_2 = {"view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '2' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 2
}
face_3 = {"view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '3' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 3
}
face_4 = {"view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '4' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 4
}
face_5 = {"view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '5' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 5
}
face_6 = {"view": ['+' + '-----' + '+',
          '|' + '     ' + '|',
          '|' + '  ' + '6' + '  ' + '|',
          '|' + '     ' + '|',
          '+' + '-----' + '+'],
          "value": 6
}
# тут мы создаем сам КУБ из 6 граней в виде списка словарей
cube = [face_1, face_2, face_3, face_4, face_5, face_6 ]
# создаем типа случайный список a граней 3 кубов
rand_set = []
a = int(input('how many ?:'))
print(a)
for f in range(a):
    rand_set.append(random.randint(0,5))
#rand_set = [random.randint(0,5), random.randint(0,5), random.randint(0,5)]
# достать список строк, описывающих грани куба 
# первого элемента в списке rand_set
# так cube[rand_set[0]]["view"] при этом получишь значение ключа словаря
# face_4["view"] который сидит в списке cube НО является ссылкой 
# первого элемента списка rand_set с индексом 0
# но грань возметься из куба - переменной cube в которой сидит список словарей
# каждый словарь это {"view": [список строк], "value": очки}
# понимаю что пиздец как сложно, привыкай... 


for index, v in enumerate(cube[rand_set[0]]["view"]):
            # print(v, end='') # пойдет хуйня из за пробелов в гранях
    print(v, end='') # норм но в столБик
    print('   ' + cube[rand_set[1]]["view"][index], end='')
    print('   ' + cube[rand_set[2]]["view"][index])
    
    
# списка rand_set
# for index, a in enumerate(cube_1["view"]):
#     print(a, end='')
#     print(cube_2["view"][index])

