'''
# завдання 1: створити список цілих чисел від 1 до 12 за допомогою циклу:
# відповідь:
# а) створюємо умовну змінну numbers_month та присвоюємо їй значення порожнього 
   списку: 
numbers_month = []
# б) за допомогою оператора циклу for та вбудованої функщії range генеруємо у 
# змінну а список з 12 цілих чисел від 1 до 12:
for a in range(1, 13):
# в) за допомогою методу append додаємо у порожній список змінної numbers_month
#    згенеровані у змінну а 12 цілих чисел від 1 до 12:
    numbers_month.append(a)
# г) роздоуковуємо змінну numbers_month:
print(numbers_month)

або:
# створюємо список цілих чисел від 1 до 12 за допомогою генервтора списку:
# і функції range:
numbers_month = [x for x in range(1, 13)]
print(numbers_month)

або:
# формуємо список цілих чисел за допомогою функції list та генератора range:
list(range(1,13))

подвоюємо значення цілих чисел у списку:
numbers_month = [x*2 for x in range(1, 13)]
print(numbers_month)

# завдання 1,1: створити список парних цілих чисел в діапазоні від 1 до 12: 
# а) створюємо список цілих чисел від 1 до 12 за допомогою генервтора списку
#    та функції list, поміщаючи його до змінної numbers:
numbers = list(range(1,13))
# б)створюємо умовну змінну numbers_odd та присвоюємо їй значення порожнього 
#    списку: 
numbers_odd = []
# в)за допомогою оператора циклу for поміщаємо у змінну у список з 12 цілих 
# чисел від 1 до 12:
for x in numbers:
# в) за допомогою умовного оператора if виокремлюємо зі змінної х парні числа
#    та методом append додаємо їх у порожній список змінної numbers_odd:
    if x%2 == 0:
        numbers_odd.append(x) 
# г) роздоуковуємо змінну numbers_odd:
print(numbers_odd)

або:
формуємо список цілих парних чисел за допомогою функції for, генератора range
умовногоа оператора if, поміщаючи його до змінної а:
а = [x for x in range(1,13) if x%2 == 0]



# завдання 2: створити словник, в якому кожному цілому числу зі списку 
# numbers_month (ключ) буде відповідати назва місяця (значення):
# створюємо список цілих чисел від 1 до 12 за допомогою генервтора списку:
# і функції range:
numbers_month = [x for x in range(1, 13)]
# а) формуємо список із назвою місяців:
months = [january, February, March, April, May, June, 
         July, August, September, October, november, December]
# б) із використанням генервтора цілих чисел range та оператора zip 
# створюємо словник numbers_month:
numbers_month = {x : y for x,y in zip(numbers_month, months)}

або:
формуємо та роздруковуємо список, що складається з пар номер місяця - 
- назва місяця:   
print(list(zip(numbers_month, months)))

'
# Завдання 3: створити програму, яка приймає в якості аргумента
# номер місяця, та повертає рядок із назвою сезону року: 
А) за допомогою оператора input виводимо у консоль рядок у дужках, та
# запрошуємо у користувача ввести номер місяця, зберігаючи його у зиінній а: 
a = input('Введи любое число от 1 до 12 - ')
# б) використовуючи умовний оператор if та логічний оператор or створюємо 
# набір умов для визначення номерів зимових місяців, повертаємо рядок winter: 
if int(a) == 12 or int(a) == 1 or int(a) == 2: 
    print('winter')
 # в) здійснюємо аналогічні дії щодо інших значень аргумента а:   
if int(a) == 3 or int(a) == 4 or int(a) == 5: 
    print('Spring')
if int(a) == 6 or int(a) == 7 or int(a) == 8: 
    print('summer')
if int(a) == 9 or int(a) == 10 or int(a) == 11: 
    print('autumn')

'''

# завдання 1: створити функцию season,  яка приймає в якості аргумента
# номер місяця, та повертає рядок із назвою сезону року: 
# відповідь:
# а) створюємо за допомогою ключового слова def функцию season, яка  
#    приймає в якості аргумента змінну а: 
def season(a):
# б) використовуючи умовний оператор if та логічний оператор or створюємо 
# набір умов для визначення номерів зимових місяців, повертаємо рядок winter:    
    if a == 12 or a == 1 or a == 2: 
        return ('winter')
# в) здійснюємо аналогічні дії щодо інших значень аргумента а:
    if a == 3 or a == 4 or a == 5: 
        return('Spring')
    if a == 6 or a == 7 or a == 8: 
        return('summer')
    if a == 9 or a == 10 or a == 11: 
        return('autumn')
# г) за допомогою оператора input виводимо у консоль рядок у дужках, 
# запрошуємо у користувача ввести номер місяця, зберігаючи його у зиінній а: 
a = int(input('Введи любое число от 1 до 12 - '))
# д) викликаємо функцию season зі змінною а:
print(season(a))

